4.gas-liquid shock tube/KNP_mod/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
5000
(
1000000000
1000000000
1000000000
1000000000
1000000000
1000000000
1000000000
1000000000
...
)
;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    empty1
    {
        type            empty;
    }
    empty2
    {
        type            empty;
    }
}


// ************************************************************************* //
